; domain
(define (domain BLOCKS)
	(:requirements :strips :typing :equality)
	(:types block)
	(:constants )
	(:functions
		(total-cost )
	)
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g1_done___ )
		(g2_done___ )
		(g0_achieved0 )
		(g1_achieved0 )
		(g2_achieved0 )
		(g0_achieved1 )
		(g1_achieved1 )
		(g2_achieved1 )
		(g0_achieved2 )
		(g1_achieved2 )
		(g2_achieved2 )
		(g0_on ?x1 - block ?x2 - block)
		(g1_on ?x1 - block ?x2 - block)
		(g2_on ?x1 - block ?x2 - block)
		(g0_ontable ?x1 - block)
		(g1_ontable ?x1 - block)
		(g2_ontable ?x1 - block)
		(g0_clear ?x1 - block)
		(g1_clear ?x1 - block)
		(g2_clear ?x1 - block)
		(g0_handempty )
		(g1_handempty )
		(g2_handempty )
		(g0_holding ?x1 - block)
		(g1_holding ?x1 - block)
		(g2_holding ?x1 - block)
		(g0_achieved0 )
		(g1_achieved0 )
		(g2_achieved0 )
		(g0_achieved1 )
		(g1_achieved1 )
		(g2_achieved1 )
		(g0_achieved2 )
		(g1_achieved2 )
		(g2_achieved2 )
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_clear r) (g0_on r a) (g0_on a t) (g0_ontable t))
	:effect (and (g0_done___ ))
)
(:action mark-done-g1
	:parameters ()
	:precondition (and (split ) (g1_clear p) (g1_on p e) (g1_on e t) (g1_ontable t))
	:effect (and (g1_done___ ))
)
(:action mark-done-g2
	:parameters ()
	:precondition (and (split ) (g2_clear a) (g2_on a p) (g2_on p e) (g2_on e r) (g2_on r t) (g2_ontable t))
	:effect (and (g2_done___ ))
)
(:action gGLOBAL_pick-up
	:parameters (?x1 - block)
	:precondition (and (unsplit ) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_ontable ?x1) (g1_ontable ?x1) (g2_ontable ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_ontable ?x1)) (not (g1_ontable ?x1)) (not (g2_ontable ?x1)) (not (g0_clear ?x1)) (not (g1_clear ?x1)) (not (g2_clear ?x1)) (not (g0_handempty )) (not (g1_handempty )) (not (g2_handempty )) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (increase (total-cost ) 1))
)
(:action g0_pick-up
	:parameters (?x1 - block)
	:precondition (and (g0_clear ?x1) (g0_ontable ?x1) (g0_handempty ) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_ontable ?x1)) (not (g0_clear ?x1)) (not (g0_handempty )) (g0_holding ?x1) (increase (total-cost ) 56133.0))
)
(:action g1_pick-up
	:parameters (?x1 - block)
	:precondition (and (g1_clear ?x1) (g1_ontable ?x1) (g1_handempty ) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_ontable ?x1)) (not (g1_clear ?x1)) (not (g1_handempty )) (g1_holding ?x1) (increase (total-cost ) 201619.0))
)
(:action g2_pick-up
	:parameters (?x1 - block)
	:precondition (and (g2_clear ?x1) (g2_ontable ?x1) (g2_handempty ) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_ontable ?x1)) (not (g2_clear ?x1)) (not (g2_handempty )) (g2_holding ?x1) (increase (total-cost ) 212761.0))
)
(:action gGLOBAL_put-down
	:parameters (?x1 - block)
	:precondition (and (unsplit ) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_holding ?x1)) (not (g1_holding ?x1)) (not (g2_holding ?x1)) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ) (g0_ontable ?x1) (g1_ontable ?x1) (g2_ontable ?x1) (increase (total-cost ) 1))
)
(:action g0_put-down
	:parameters (?x1 - block)
	:precondition (and (g0_holding ?x1) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_holding ?x1)) (g0_clear ?x1) (g0_handempty ) (g0_ontable ?x1) (increase (total-cost ) 56133.0))
)
(:action g1_put-down
	:parameters (?x1 - block)
	:precondition (and (g1_holding ?x1) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_holding ?x1)) (g1_clear ?x1) (g1_handempty ) (g1_ontable ?x1) (increase (total-cost ) 201619.0))
)
(:action g2_put-down
	:parameters (?x1 - block)
	:precondition (and (g2_holding ?x1) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_holding ?x1)) (g2_clear ?x1) (g2_handempty ) (g2_ontable ?x1) (increase (total-cost ) 212761.0))
)
(:action gGLOBAL_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (unsplit ) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (g0_clear ?x2) (g1_clear ?x2) (g2_clear ?x2))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_holding ?x1)) (not (g1_holding ?x1)) (not (g2_holding ?x1)) (not (g0_clear ?x2)) (not (g1_clear ?x2)) (not (g2_clear ?x2)) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ) (g0_on ?x1 ?x2) (g1_on ?x1 ?x2) (g2_on ?x1 ?x2) (increase (total-cost ) 1))
)
(:action g0_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g0_holding ?x1) (g0_clear ?x2) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_holding ?x1)) (not (g0_clear ?x2)) (g0_clear ?x1) (g0_handempty ) (g0_on ?x1 ?x2) (increase (total-cost ) 56133.0))
)
(:action g1_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g1_holding ?x1) (g1_clear ?x2) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_holding ?x1)) (not (g1_clear ?x2)) (g1_clear ?x1) (g1_handempty ) (g1_on ?x1 ?x2) (increase (total-cost ) 201619.0))
)
(:action g2_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g2_holding ?x1) (g2_clear ?x2) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_holding ?x1)) (not (g2_clear ?x2)) (g2_clear ?x1) (g2_handempty ) (g2_on ?x1 ?x2) (increase (total-cost ) 212761.0))
)
(:action gGLOBAL_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (unsplit ) (g0_on ?x1 ?x2) (g1_on ?x1 ?x2) (g2_on ?x1 ?x2) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (g0_clear ?x2) (g1_clear ?x2) (g2_clear ?x2) (not (g0_clear ?x1)) (not (g1_clear ?x1)) (not (g2_clear ?x1)) (not (g0_handempty )) (not (g1_handempty )) (not (g2_handempty )) (not (g0_on ?x1 ?x2)) (not (g1_on ?x1 ?x2)) (not (g2_on ?x1 ?x2)) (increase (total-cost ) 1))
)
(:action g0_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g0_on ?x1 ?x2) (g0_clear ?x1) (g0_handempty ) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (g0_holding ?x1) (g0_clear ?x2) (not (g0_clear ?x1)) (not (g0_handempty )) (not (g0_on ?x1 ?x2)) (increase (total-cost ) 56133.0))
)
(:action g1_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g1_on ?x1 ?x2) (g1_clear ?x1) (g1_handempty ) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (g1_holding ?x1) (g1_clear ?x2) (not (g1_clear ?x1)) (not (g1_handempty )) (not (g1_on ?x1 ?x2)) (increase (total-cost ) 201619.0))
)
(:action g2_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g2_on ?x1 ?x2) (g2_clear ?x1) (g2_handempty ) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (g2_holding ?x1) (g2_clear ?x2) (not (g2_clear ?x1)) (not (g2_handempty )) (not (g2_on ?x1 ?x2)) (increase (total-cost ) 212761.0))
)
)

; problem
(define (problem p2)
	(:domain blocks)
	(:objects p - block a - block t - block e - block r - block)
	(:init 
		(unsplit )
		(g0_HANDEMPTY )
		(g1_HANDEMPTY )
		(g2_HANDEMPTY )
		(g0_ONTABLE a)
		(g1_ONTABLE a)
		(g2_ONTABLE a)
		(g0_CLEAR e)
		(g1_CLEAR e)
		(g2_CLEAR e)
		(g0_ON e a)
		(g1_ON e a)
		(g2_ON e a)
		(g0_ONTABLE p)
		(g1_ONTABLE p)
		(g2_ONTABLE p)
		(g0_CLEAR r)
		(g1_CLEAR r)
		(g2_CLEAR r)
		(g0_ON t p)
		(g1_ON t p)
		(g2_ON t p)
		(g0_ON r t)
		(g1_ON r t)
		(g2_ON r t)
		(= (total-cost ) 0.0)
	)
	(:goal (and (g0_clear r) (g0_on r a) (g0_on a t) (g0_ontable t) (g1_clear p) (g1_on p e) (g1_on e t) (g1_ontable t) (g2_clear a) (g2_on a p) (g2_on p e) (g2_on e r) (g2_on r t) (g2_ontable t)))
	(:metric minimize (total-cost ))
)

; plan
1. (gglobal_unstack r t)
   deleted: (g0_clear r) (g1_clear r) (g2_clear r) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on r t) (g1_on r t) (g2_on r t)
   added: (g0_holding r) (g1_holding r) (g2_holding r) (g0_clear t) (g1_clear t) (g2_clear t)
   goals met: 0 of 14
2. (gglobal_put-down r)
   deleted: (g0_holding r) (g1_holding r) (g2_holding r)
   added: (g0_clear r) (g1_clear r) (g2_clear r) (g0_handempty) (g1_handempty) (g2_handempty) (g0_ontable r) (g1_ontable r) (g2_ontable r)
   goals met: 1 of 14
3. (gglobal_unstack t p)
   deleted: (g0_clear t) (g1_clear t) (g2_clear t) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on t p) (g1_on t p) (g2_on t p)
   added: (g0_holding t) (g1_holding t) (g2_holding t) (g0_clear p) (g1_clear p) (g2_clear p)
   goals met: 2 of 14
4. (gglobal_put-down t)
   deleted: (g0_holding t) (g1_holding t) (g2_holding t)
   added: (g0_clear t) (g1_clear t) (g2_clear t) (g0_handempty) (g1_handempty) (g2_handempty) (g0_ontable t) (g1_ontable t) (g2_ontable t)
   goals met: 5 of 14
5. (gglobal_unstack e a)
   deleted: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on e a) (g1_on e a) (g2_on e a)
   added: (g0_holding e) (g1_holding e) (g2_holding e) (g0_clear a) (g1_clear a) (g2_clear a)
   goals met: 6 of 14
6. (gglobal_stack e p)
   deleted: (g0_holding e) (g1_holding e) (g2_holding e) (g0_clear p) (g1_clear p) (g2_clear p)
   added: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on e p) (g1_on e p) (g2_on e p)
   goals met: 5 of 14
7. (do-split)
   deleted: (unsplit)
   added: (split)
   goals met: 5 of 14
8. (g0_pick-up a)
   deleted: (g0_ontable a) (g0_clear a) (g0_handempty)
   added: (g0_holding a)
   goals met: 5 of 14
9. (g0_stack a t)
   deleted: (g0_holding a) (g0_clear t)
   added: (g0_clear a) (g0_handempty) (g0_on a t)
   goals met: 6 of 14
10. (g0_pick-up r)
   deleted: (g0_ontable r) (g0_clear r) (g0_handempty)
   added: (g0_holding r)
   goals met: 5 of 14
11. (g0_stack r a)
   deleted: (g0_holding r) (g0_clear a)
   added: (g0_clear r) (g0_handempty) (g0_on r a)
   goals met: 7 of 14
12. (mark-done-g0)
   added: (g0_done___)
   goals met: 7 of 14
13. (g1_unstack e p)
   deleted: (g1_clear e) (g1_handempty) (g1_on e p)
   added: (g1_holding e) (g1_clear p)
   goals met: 8 of 14
14. (g1_stack e t)
   deleted: (g1_holding e) (g1_clear t)
   added: (g1_clear e) (g1_handempty) (g1_on e t)
   goals met: 9 of 14
15. (g1_pick-up p)
   deleted: (g1_ontable p) (g1_clear p) (g1_handempty)
   added: (g1_holding p)
   goals met: 8 of 14
16. (g1_stack p e)
   deleted: (g1_holding p) (g1_clear e)
   added: (g1_clear p) (g1_handempty) (g1_on p e)
   goals met: 10 of 14
17. (mark-done-g1)
   added: (g1_done___)
   goals met: 10 of 14
18. (g2_pick-up r)
   deleted: (g2_ontable r) (g2_clear r) (g2_handempty)
   added: (g2_holding r)
   goals met: 10 of 14
19. (g2_stack r t)
   deleted: (g2_holding r) (g2_clear t)
   added: (g2_clear r) (g2_handempty) (g2_on r t)
   goals met: 11 of 14
20. (g2_unstack e p)
   deleted: (g2_clear e) (g2_handempty) (g2_on e p)
   added: (g2_holding e) (g2_clear p)
   goals met: 11 of 14
21. (g2_stack e r)
   deleted: (g2_holding e) (g2_clear r)
   added: (g2_clear e) (g2_handempty) (g2_on e r)
   goals met: 12 of 14
22. (g2_pick-up p)
   deleted: (g2_ontable p) (g2_clear p) (g2_handempty)
   added: (g2_holding p)
   goals met: 12 of 14
23. (g2_stack p e)
   deleted: (g2_holding p) (g2_clear e)
   added: (g2_clear p) (g2_handempty) (g2_on p e)
   goals met: 13 of 14
24. (g2_pick-up a)
   deleted: (g2_ontable a) (g2_clear a) (g2_handempty)
   added: (g2_holding a)
   goals met: 12 of 14
25. (g2_stack a p)
   deleted: (g2_holding a) (g2_clear p)
   added: (g2_clear a) (g2_handempty) (g2_on a p)
   goals met: 14 of 14
